# data manipulator or transformation 
set_index()
reset_index()
rename()
replace()
map()
drop()
drop_duplicates()

In [1]:
import pandas as pd
import numpy as np

In [2]:
d={
    'empno':['e1','e2','e3','e4','e2'],
    'name':['smith','scott','allen','smith','scott'],
    'sal':[100,200,100,500,200],
    'un2':[np.nan,0,0,1,0],
    'hiredate':['01-jan-2000','01-jan-2001','4-feb-2000','8-dec-2001','01-jan-2001'],
    'deptno':[100,200,300,400,200],
    'un1':[0,0,0,0,0]
}
emp=pd.DataFrame(d)
emp

  empno   name  sal  un2     hiredate  deptno  un1
0    e1  smith  100  NaN  01-jan-2000     100    0
1    e2  scott  200  0.0  01-jan-2001     200    0
2    e3  allen  100  0.0   4-feb-2000     300    0
3    e4  smith  500  1.0   8-dec-2001     400    0
4    e2  scott  200  0.0  01-jan-2001     200    0

In [3]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   empno     5 non-null      object
 1   name      5 non-null      object
 2   sal       5 non-null      int64
 3   un2       4 non-null      float64
 4   hiredate  5 non-null      object
 5   deptno    5 non-null      int64
 6   un1       5 non-null      int64
dtypes: float64(1), int64(3), object(3)
memory usage: 412.0+ bytes

# set_index

In [4]:
emp.set_index('empno')
#emp.set_index('empno',drop=True) # by default drop=True --->the column you use for the new index will be removed from the DataFrame's columns.

        name  sal  un2     hiredate  deptno  un1
empno
e1     smith  100  NaN  01-jan-2000     100    0
e2     scott  200  0.0  01-jan-2001     200    0
e3     allen  100  0.0   4-feb-2000     300    0
e4     smith  500  1.0   8-dec-2001     400    0
e2     scott  200  0.0  01-jan-2001     200    0

In [5]:
emp.columns

Index(['empno', 'name', 'sal', 'un2', 'hiredate', 'deptno', 'un1'], dtype='object')

In [6]:
emp.set_index(['empno','name'])

             sal  un2     hiredate  deptno  un1
empno name
e1    smith  100  NaN  01-jan-2000     100    0
e2    scott  200  0.0  01-jan-2001     200    0
e3    allen  100  0.0   4-feb-2000     300    0
e4    smith  500  1.0   8-dec-2001     400    0
e2    scott  200  0.0  01-jan-2001     200    0

In [7]:
emp.set_index('empno',drop=False) # the 'empno' column is kept as a regular column in the DataFrame in addition to being used as the index.

      empno   name  sal  un2     hiredate  deptno  un1
empno
e1       e1  smith  100  NaN  01-jan-2000     100    0
e2       e2  scott  200  0.0  01-jan-2001     200    0
e3       e3  allen  100  0.0   4-feb-2000     300    0
e4       e4  smith  500  1.0   8-dec-2001     400    0
e2       e2  scott  200  0.0  01-jan-2001     200    0

In [8]:
emp.columns

Index(['empno', 'name', 'sal', 'un2', 'hiredate', 'deptno', 'un1'], dtype='object')

# reset_index

In [9]:
# emp=emp.reset_index()
# emp

# rename

In [10]:
emp.rename(columns={'name':'ename','sal':'salary'})
#----------------------OR----------
emp.rename({'name':'ename','sal':'salary'},axis=1) # by default axis=0

  empno  ename  salary  un2     hiredate  deptno  un1
0    e1  smith     100  NaN  01-jan-2000     100    0
1    e2  scott     200  0.0  01-jan-2001     200    0
2    e3  allen     100  0.0   4-feb-2000     300    0
3    e4  smith     500  1.0   8-dec-2001     400    0
4    e2  scott     200  0.0  01-jan-2001     200    0

In [11]:
emp.rename(index={1:10,3:30})
#------------OR------------
emp.rename({1:10,3:30})# by default axis=0

   empno   name  sal  un2     hiredate  deptno  un1
0     e1  smith  100  NaN  01-jan-2000     100    0
10    e2  scott  200  0.0  01-jan-2001     200    0
2     e3  allen  100  0.0   4-feb-2000     300    0
30    e4  smith  500  1.0   8-dec-2001     400    0
4     e2  scott  200  0.0  01-jan-2001     200    0

In [12]:
emp # here without inplace or assignment operator the changes we made are temporary not permanant

  empno   name  sal  un2     hiredate  deptno  un1
0    e1  smith  100  NaN  01-jan-2000     100    0
1    e2  scott  200  0.0  01-jan-2001     200    0
2    e3  allen  100  0.0   4-feb-2000     300    0
3    e4  smith  500  1.0   8-dec-2001     400    0
4    e2  scott  200  0.0  01-jan-2001     200    0

In [13]:
emp.rename(index={1:20,3:40,4:20,0:10,2:30},columns={'name':'ename','sal':'salary'},inplace=True)

In [14]:
emp

   empno  ename  salary  un2     hiredate  deptno  un1
10    e1  smith     100  NaN  01-jan-2000     100    0
20    e2  scott     200  0.0  01-jan-2001     200    0
30    e3  allen     100  0.0   4-feb-2000     300    0
40    e4  smith     500  1.0   8-dec-2001     400    0
20    e2  scott     200  0.0  01-jan-2001     200    0

# replace

In [15]:
emp=emp.replace({1200:8989})
emp=emp.replace({100:454})

In [16]:
emp['salary']=emp['salary'].replace({200:999,500:777})

In [17]:
emp

   empno  ename  salary  un2     hiredate  deptno  un1
10    e1  smith     454  NaN  01-jan-2000     454    0
20    e2  scott     999  0.0  01-jan-2001     200    0
30    e3  allen     454  0.0   4-feb-2000     300    0
40    e4  smith     777  1.0   8-dec-2001     400    0
20    e2  scott     999  0.0  01-jan-2001     200    0

# map

In [18]:
emp['deptno']=emp['deptno'].map({8989:101,300:102,400:103})
emp

   empno  ename  salary  un2     hiredate  deptno  un1
10    e1  smith     454  NaN  01-jan-2000     NaN    0
20    e2  scott     999  0.0  01-jan-2001     NaN    0
30    e3  allen     454  0.0   4-feb-2000   102.0    0
40    e4  smith     777  1.0   8-dec-2001   103.0    0
20    e2  scott     999  0.0  01-jan-2001     NaN    0

# drop_duplicates()

In [19]:
emp=emp.drop_duplicates(keep="last")#keep='first'(default one),'last',False
emp

   empno  ename  salary  un2     hiredate  deptno  un1
10    e1  smith     454  NaN  01-jan-2000     NaN    0
30    e3  allen     454  0.0   4-feb-2000   102.0    0
40    e4  smith     777  1.0   8-dec-2001   103.0    0
20    e2  scott     999  0.0  01-jan-2001     NaN    0

# drop()

In [20]:
emp.drop(['un1','un2'],axis=1)

   empno  ename  salary     hiredate  deptno
10    e1  smith     454  01-jan-2000     NaN
30    e3  allen     454   4-feb-2000   102.0
40    e4  smith     777   8-dec-2001   103.0
20    e2  scott     999  01-jan-2001     NaN

In [21]:
emp.drop(columns=['un1','un2'],index=[10,40],inplace=True)
emp

C:\Users\Deepika C R\AppData\Local\Temp\ipykernel_23328\3401425250.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp.drop(columns=['un1','un2'],index=[10,40],inplace=True)

   empno  ename  salary     hiredate  deptno
30    e3  allen     454   4-feb-2000   102.0
20    e2  scott     999  01-jan-2001     NaN

# METHODS RELATED TO DATETIME DATATYPES
to_datetime()
date_range()
date_offset()

# to_datetime

In [22]:
#pd.to_datetime(['01-dec-2024','01-july-2023'],format='%d-%B-%Y',errors='ignore')#ignoring both error and answer particular line is ignored and go for others.
pd.to_datetime(['01-dec-2024','01-july-2023'],format='%d-%B-%Y',errors='coerce')#convert all data when there is error it gives NaT.

DatetimeIndex(['NaT', '2023-07-01'], dtype='datetime64[ns]', freq=None)

In [23]:
emp['hiredate']=pd.to_datetime(emp['hiredate'],format='%d-%b-%Y')
emp

C:\Users\Deepika C R\AppData\Local\Temp\ipykernel_23328\311571964.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp['hiredate']=pd.to_datetime(emp['hiredate'],format='%d-%b-%Y')

   empno  ename  salary   hiredate  deptno
30    e3  allen     454 2000-02-04   102.0
20    e2  scott     999 2001-01-01     NaN

In [24]:
date1=pd.to_datetime('01-july-2023 4:35:59', format='%d-%B-%Y %H:%M:%S',errors='raise')
print(date1)
date1.second

2023-07-01 04:35:59

59

# date_range()

In [25]:
pd.date_range('02-dec-2024','02-dec-2025')

DatetimeIndex(['2024-12-02', '2024-12-03', '2024-12-04', '2024-12-05',
               '2024-12-06', '2024-12-07', '2024-12-08', '2024-12-09',
               '2024-12-10', '2024-12-11',
               ...
               '2025-11-23', '2025-11-24', '2025-11-25', '2025-11-26',
               '2025-11-27', '2025-11-28', '2025-11-29', '2025-11-30',
               '2025-12-01', '2025-12-02'],
              dtype='datetime64[ns]', length=366, freq='D')

In [26]:
list_date=pd.date_range('02-dec-2024','02-dec-2025',freq='15D')
len(list_date)

25

In [27]:
dr1=pd.date_range('02-dec-2024','02-dec-2025',freq='2ME')
dr2=pd.date_range('02-dec-2024','02-dec-2034',freq='2YE')
dr3=pd.date_range('02-dec-2024',periods=2,freq='2ME')
dr4=pd.date_range('02-dec-2024',periods=10,freq='YE')
dr5=pd.date_range('02-dec-2024',periods=10,freq='2YE')
print(dr1,dr2,dr3,dr4,dr5)

DatetimeIndex(['2024-12-31', '2025-02-28', '2025-04-30', '2025-06-30',
               '2025-08-31', '2025-10-31'],
              dtype='datetime64[ns]', freq='2ME') DatetimeIndex(['2024-12-31', '2026-12-31', '2028-12-31', '2030-12-31',
               '2032-12-31'],
              dtype='datetime64[ns]', freq='2YE-DEC') DatetimeIndex(['2024-12-31', '2025-02-28'], dtype='datetime64[ns]', freq='2ME') DatetimeIndex(['2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC') DatetimeIndex(['2024-12-31', '2026-12-31', '2028-12-31', '2030-12-31',
               '2032-12-31', '2034-12-31', '2036-12-31', '2038-12-31',
               '2040-12-31', '2042-12-31'],
              dtype='datetime64[ns]', freq='2YE-DEC')

# date_offset()

In [28]:
x=pd.DateOffset(days=2,months=10,years=5,hours=1)
pd.to_datetime('2-dec-2024 3:35:59')+x

Timestamp('2030-10-04 04:35:59')

In [29]:
x=pd.DateOffset(day=27,month=5,year=2001,hour=1)
pd.to_datetime('2-dec-2024 3:35:59')+x

Timestamp('2001-05-27 01:35:59')

In [30]:
x=pd.DateOffset(days=2,months=10,years=5,hours=1)
pd.to_datetime('2-dec-2024 3:35:59')+x

Timestamp('2030-10-04 04:35:59')

In [31]:
pd.to_datetime('2-dec-2024 3:35:59')-x

Timestamp('2019-01-31 02:35:59')

In [32]:
x=pd.DateOffset(days=2,months=10,years=5)
pd.to_datetime(['02-dec-2024','01-oct-2030'],format='%d-%b-%Y')+x

DatetimeIndex(['2030-10-04', '2036-08-03'], dtype='datetime64[ns]', freq=None)